ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/RTC_B_1.0.xml
    <register id="RTC_B_TOUT7_4" width="32" offset="0x1284" description="Tamper Output 7 to 4">
        <bitfield id="TIO4" description="This bit sets the value of the pin tamper I/O 4 (TIO4) when the output is enabled through TOE4 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="TIO5" description="This bit sets the value of the pin tamper I/O 5 (TIO5) when the output is enabled through TOE5 register." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="TIO6" description="This bit sets the value of the pin tamper I/O 2 (TIO6) when the output is enabled through TOE6 register." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="TIO7" description="This bit sets the value of the pin tamper I/O 7 (TIO7) when the output is enabled through TOE7 register." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
    <register id="RTC_B_TOUT11_8" width="32" offset="0x1288" description="Tamper Output 11 to 8">
        <bitfield id="TIO8" description="This bit sets the value of the pin tamper I/O 8 (TIO8) when the output is enabled through TOE8 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="TIO9" description="This bit sets the value of the pin tamper I/O 9 (TIO9) when the output is enabled through TOE9 register." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="TIO10" description="This bit sets the value of the pin tamper I/O 10 (TIO10) when the output is enabled through TOE10 register." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="TIO11" description="This bit sets the value of the pin tamper I/O 11 (TIO11) when the output is enabled through TOE11 register." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
    <register id="RTC_B_TOUT15_12" width="32" offset="0x128C" description="Tamper Output 15 to 12">
        <bitfield id="TIO12" description="This bit sets the value of the pin tamper I/O 12 (TIO12) when the output is enabled through TOE12 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="TIO13" description="This bit sets the value of the pin tamper I/O 13 (TIO13) when the output is enabled through TOE13 register." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="TIO14" description="This bit sets the value of the pin tamper I/O 14 (TIO14) when the output is enabled through TOE14 register." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="TIO15" description="This bit sets the value of the pin tamper I/O 15 (TIO15) when the output is enabled through TOE15 register." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
    <register id="RTC_B_TOE3_0" width="32" offset="0x1290" description="Tamper Output Enable 3 to 0">
        <bitfield id="TIO0" description="Enables data output for tamper I/O 0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
        <bitfield id="TIO1" description="Enables data output for tamper I/O 1" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
        <bitfield id="TIO2" description="Enables data output for tamper I/O 2" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
        <bitfield id="TIO3" description="Enables data output for tamper I/O 3" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
    </register>
    <register id="RTC_B_TOE7_4" width="32" offset="0x1294" description="Tamper Output Enable 7 to 4">
        <bitfield id="TIO4" description="Enables data output for tamper I/O 4" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
        <bitfield id="TIO5" description="Enables data output for tamper I/O 5" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
        <bitfield id="TIO6" description="Enables data output for tamper I/O 6" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
        <bitfield id="TIO7" description="Enables data output for tamper I/O 7" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
    </register>
    <register id="RTC_B_TOE11_8" width="32" offset="0x1298" description="Tamper Output Enable 7 to 4">
        <bitfield id="TIO8" description="Enables data output for tamper I/O 8" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
        <bitfield id="TIO9" description="Enables data output for tamper I/O 9" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
        <bitfield id="TIO10" description="Enables data output for tamper I/O 10" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
        <bitfield id="TIO11" description="Enables data output for tamper I/O 11" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
    </register>
    <register id="RTC_B_TOE15_12" width="32" offset="0x129C" description="Tamper Output Enable 7 to 4">
        <bitfield id="TIO12" description="Enables data output for tamper I/O 12" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
        <bitfield id="TIO13" description="Enables data output for tamper I/O 13" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
        <bitfield id="TIO14" description="Enables data output for tamper I/O 14" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
        <bitfield id="TIO15" description="Enables data output for tamper I/O 15" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
    </register>
    <register id="RTC_B_TIN3_0" width="32" offset="0x12A0" description="Tamper Input Register">
        <bitfield id="TIO0" description="This bit reads the data input value of tamper I/O 0." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO1" description="This bit reads the data input value of tamper I/O 1." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO2" description="This bit reads the data input value of tamper I/O 2." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO3" description="This bit reads the data input value of tamper I/O 3." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="RTC_B_TIN7_4" width="32" offset="0x12A4" description="Tamper Input Register">
        <bitfield id="TIO4" description="This bit reads the data input value of tamper I/O 4." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO5" description="This bit reads the data input value of tamper I/O 5." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO6" description="This bit reads the data input value of tamper I/O 6." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO7" description="This bit reads the data input value of tamper I/O 7." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="RTC_B_TIN11_8" width="32" offset="0x12A8" description="Tamper Input Register">
        <bitfield id="TIO8" description="This bit reads the data input value of tamper I/O 8." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO9" description="This bit reads the data input value of tamper I/O 9." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO10" description="This bit reads the data input value of tamper I/O 10." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO11" description="This bit reads the data input value of tamper I/O 11." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
