ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/RTC_B_1.0.xml
    <register id="RTC_B_TIN15_12" width="32" offset="0x12AC" description="Tamper Input Register">
        <bitfield id="TIO12" description="This bit reads the data input value of tamper I/O 12." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO13" description="This bit reads the data input value of tamper I/O 13." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO14" description="This bit reads the data input value of tamper I/O 14." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO15" description="This bit reads the data input value of tamper I/O 15." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="RTC_B_HEARTBEAT" width="32" offset="0x12C0" description="Heartbeat Register">
        <bitfield id="HBINTERVAL" description="Heart beat interval" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="HBINT0P125" value="0x0" description="Heart beat interval 0.125 sec"/>
            <bitenum id="HBINT0P25" value="0x1" description="Heart beat interval 0.25 sec"/>
            <bitenum id="HBINT0P5" value="0x2" description="Heart beat interval 0.5 sec"/>
            <bitenum id="HBINT1" value="0x3" description="Heart beat interval 1 sec"/>
            <bitenum id="HBINT2" value="0x4" description="Heart beat interval 2 sec"/>
            <bitenum id="HBINT4" value="0x5" description="Heart beat interval 4 sec"/>
            <bitenum id="HBINT8" value="0x6" description="Heart beat interval 8 sec"/>
            <bitenum id="HBINT16" value="0x7" description="Heart beat interval 16 sec"/>
        </bitfield>
        <bitfield id="HBWIDTH" description="Heart beat interval width" begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="HBPWDTH1" value="0x0" description="Heart beat pulse width 1 msec"/>
            <bitenum id="HBPWDTH2" value="0x1" description="Heart beat pulse width 2 msec"/>
            <bitenum id="HBPWDTH4" value="0x2" description="Heart beat pulse width 4 msec"/>
            <bitenum id="HBPWDTH8" value="0x3" description="Heart beat pulse width 8 msec"/>
            <bitenum id="HBPWDTH16" value="0x4" description="Heart beat pulse width 16 msec"/>
            <bitenum id="HBPWDTH32" value="0x5" description="Heart beat pulse width 32 msec"/>
            <bitenum id="HBPWDTH64" value="0x6" description="Heart beat pulse width 64 msec"/>
            <bitenum id="HBPWDTH128" value="0x7" description="Heart beat pulse width 128 msec"/>
        </bitfield>
        <bitfield id="HBMODE" description="Heart beat mode" begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="HB_DIS" value="0x0" description="Heart beat disabled"/>
            <bitenum id="HB_ALLWAYS" value="0x1" description="Heart beat allways enabled"/>
            <bitenum id="HB_TS" value="0x2" description="Heart beat enabled when time stamp event detected"/>
            <bitenum id="HB_VDDFAIL" value="0x3" description="Heart beat when VDD has fail condition"/>
        </bitfield>
    </register>
    <register id="RTC_B_TIOLOCK" width="32" offset="0x12FC" description="Tamper I/O lock register">
        <bitfield id="PROTECT" description="If set, the register bit will protect the TIOCTL and HEARTBEAT from accidental writes." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Tamper I/O control is writable."/>
            <bitenum id="SET" value="0x1" description="Tamper I/O control is read only access."/>
        </bitfield>
    </register>
    <register id="RTC_B_WDTEN" width="32" offset="0x1300" description="Watchdog Timer Enable Register">
        <bitfield id="ENABLE" description="Enable bit for the WDT." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Disable WDT"/>
            <bitenum id="SET" value="0x1" description="Enable WDT"/>
        </bitfield>
    </register>
    <register id="RTC_B_WDTDBGCTL" width="32" offset="0x1304" description="Watchdog Timer Debug Control Register">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The WDT freezes functionality while the CPU is Halted during debug and resumes when the CPU is active."/>
            <bitenum id="RUN" value="0x1" description="The WDT ignores the state of the CPU Halted debug state."/>
        </bitfield>
    </register>
    <register id="RTC_B_WDTCTL" width="32" offset="0x1308" description="Watchdog Timer Control Register">
        <bitfield id="CLKDIV" description="Module Clock Divider, Divide the clock source by CLKDIV+1. Divider values from /1 to /8 are possible." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="MIN" value="0x0" description="Minimum value"/>
            <bitenum id="MAX" value="0x7" description="Maximum value"/>
        </bitfield>
        <bitfield id="PER" description="Timer Period of the WDT. These bits select the total watchdog timer count." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="PER_EN_25" value="0x0" description="Total timer count is 2^25"/>
            <bitenum id="PER_EN_21" value="0x1" description="Total timer count is 2^21"/>
            <bitenum id="PER_EN_18" value="0x2" description="Total timer count is 2^18"/>
            <bitenum id="PER_EN_15" value="0x3" description="Total timer count is 2^15"/>
            <bitenum id="PER_EN_12" value="0x4" description="Total timer count is 2^12 (default)"/>
            <bitenum id="PER_EN_10" value="0x5" description="Total timer count is 2^10"/>
            <bitenum id="PER_EN_8" value="0x6" description="Total timer count is 2^8"/>
            <bitenum id="PER_EN_6" value="0x7" description="Total timer count is 2^6"/>
        </bitfield>
    </register>
    <register id="RTC_B_WDTCNTRST" width="32" offset="0x130C" description="Watchdog Timer Counter Reset Register">
        <bitfield id="RESTART" description="Writing 03A7h to this register restarts the WDT Counter. Writing any other value causes a POR level reset. Read as 0x0h." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="VALUE" value="0x3A7" description="VALUE to restart the WDT counter"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value"/>
        </bitfield>
    </register>
