ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/RTC_B_1.0.xml
    <register id="RTC_B_SPMWPROT1" width="32" offset="0x1504" description="Scratch Pad Memory Write Protect Register 1">
        <bitfield id="WP_7_3" description="write protect SPMEM7 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_7_2" description="write protect SPMEM7 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_7_1" description="write protect SPMEM7 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_7_0" description="write protect SPMEM7 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_6_3" description="write protect SPMEM6 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_6_2" description="write protect SPMEM6 - DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_6_1" description="write protect SPMEM6 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_6_0" description="write protect SPMEM6 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_5_3" description="write protect SPMEM5 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_5_2" description="write protect SPMEM5 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_5_1" description="write protect SPMEM5 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_5_0" description="write protect SPMEM5 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_4_3" description="write protect SPMEM4 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_4_2" description="write protect SPMEM4 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_4_1" description="write protect SPMEM4 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_4_0" description="write protect SPMEM4 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
    </register>
    <register id="RTC_B_SPMWPROT2" width="32" offset="0x1508" description="Scratch Pad Memory Write Protect Register 2">
        <bitfield id="WP_11_3" description="write protect SPMEM11 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_11_2" description="write protect SPMEM11 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_11_1" description="write protect SPMEM11 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_11_0" description="write protect SPMEM11 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_10_3" description="write protect SPMEM10 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_10_2" description="write protect SPMEM610- DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_10_1" description="write protect SPMEM10 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_10_0" description="write protect SPMEM10 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_9_3" description="write protect SPMEM9 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_9_2" description="write protect SPMEM9 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_9_1" description="write protect SPMEM9 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_9_0" description="write protect SPMEM9 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_8_3" description="write protect SPMEM8 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_8_2" description="write protect SPMEM8 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_8_1" description="write protect SPMEM8 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_8_0" description="write protect SPMEM8 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
    </register>
    <register id="RTC_B_SPMWPROT3" width="32" offset="0x150C" description="Scratch Pad Memory Write Protect Register 3">
        <bitfield id="WP_15_3" description="write protect SPMEM15 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_15_2" description="write protect SPMEM15 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_15_1" description="write protect SPMEM15 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_15_0" description="write protect SPMEM15 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_14_3" description="write protect SPMEM14 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_14_2" description="write protect SPMEM14- DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_14_1" description="write protect SPMEM14 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_14_0" description="write protect SPMEM14 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_13_3" description="write protect SPMEM13 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_13_2" description="write protect SPMEM13 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_13_1" description="write protect SPMEM13 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_13_0" description="write protect SPMEM13 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_12_3" description="write protect SPMEM12 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_12_2" description="write protect SPMEM12 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_12_1" description="write protect SPMEM12 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_12_0" description="write protect SPMEM12 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
    </register>
    <register id="RTC_B_SPMWPROT4" width="32" offset="0x1510" description="Scratch Pad Memory Write Protect Register 4">
        <bitfield id="WP_19_3" description="write protect SPMEM19 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_19_2" description="write protect SPMEM19 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_19_1" description="write protect SPMEM19 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_19_0" description="write protect SPMEM19 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_18_3" description="write protect SPMEM18 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_18_2" description="write protect SPMEM18- DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_18_1" description="write protect SPMEM18 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_18_0" description="write protect SPMEM18 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_17_3" description="write protect SPMEM17 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_17_2" description="write protect SPMEM17 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_17_1" description="write protect SPMEM17 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_17_0" description="write protect SPMEM17 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_16_3" description="write protect SPMEM16 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_16_2" description="write protect SPMEM16 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_16_1" description="write protect SPMEM16 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_16_0" description="write protect SPMEM16 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
    </register>
