ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/RTC_B_1.0.xml
    <register id="RTC_B_SPMTERASE1" width="32" offset="0x1544" description="Scratch Pad Memory Tamper Erase Register 1">
        <bitfield id="TE_7_3" description="tamper erase enable SPMEM7 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_7_2" description="tamper erase enable SPMEM7 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_7_1" description="tamper erase enable SPMEM7 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_7_0" description="tamper erase enable SPMEM7 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_6_3" description="tamper erase enable SPMEM6 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_6_2" description="tamper erase enable SPMEM6 - DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_6_1" description="tamper erase enable SPMEM6 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_6_0" description="tamper erase enable SPMEM6 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_5_3" description="tamper erase enable SPMEM5 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_5_2" description="tamper erase enable SPMEM5 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_5_1" description="tamper erase enable SPMEM5 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_5_0" description="tamper erase enable SPMEM5 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_4_3" description="tamper erase enable SPMEM4 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_4_2" description="tamper erase enable SPMEM4 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_4_1" description="tamper erase enable SPMEM4 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_4_0" description="tamper erase enable SPMEM4 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
    </register>
    <register id="RTC_B_SPMTERASE2" width="32" offset="0x1548" description="Scratch Pad Memory Tamper Erase Register 2">
        <bitfield id="TE_11_3" description="tamper erase enable SPMEM11 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_11_2" description="tamper erase enable SPMEM11 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_11_1" description="tamper erase enable SPMEM11 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_11_0" description="tamper erase enable SPMEM11 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_10_3" description="tamper erase enable SPMEM10 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_10_2" description="tamper erase enable SPMEM10 - DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_10_1" description="tamper erase enable SPMEM10 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_10_0" description="tamper erase enable SPMEM10 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_9_3" description="tamper erase enable SPMEM9 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_9_2" description="tamper erase enable SPMEM9 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_9_1" description="tamper erase enable SPMEM9 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_9_0" description="tamper erase enable SPMEM9 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_8_3" description="tamper erase enable SPMEM8 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_8_2" description="tamper erase enable SPMEM8 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_8_1" description="tamper erase enable SPMEM8 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_8_0" description="tamper erase enable SPMEM8 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
    </register>
